import 'package:intl/intl.dart';

var dogBreedMapping = {
  'เกรย์ฮาวด์':['ดำ','Blue Fawn','น้ำเงิน','น้ำเงินลายเสือ','แดง','แดงลายเสือ','ขาว','ขาว-ดำ','ขาว-แดง','ดำลายเสือ','ขาว-น้ำเงิน','ขาว-ดำลายเสือ','ขาว-น้ำเงินลายเสือ','ขาว-แดงลายเสือ'],
  'เกรทเทอร์ สวิสส์ เมาน์เทนด๊อก':['Tricolour (ดำ-ขาว-แดง)'],
  'เกรตเดน':[ 'ดำ' , 'ดำ-ขาว', 'น้ำเงิน' , 'ลายเสือ', 'น้ำตาลแกมเหลือง','ลายจุด'],
  'โกลเด้นรีทรีฟเวอร์':[ 'ทองเข้ม' , 'ทอง', 'ทองอ่อน'],
  'คาร์ดิแก้น เวล์ช คอร์กี้':['ดำ-ขาว','น้ำเงิน-ขาว','ลายเสือ-ขาว','แดง-ขาว','เซเบิล-ขาว'],
  'คีชอน':['ดำ-เงิน','เทา-ดำ','เทา-เงิน-ดำ','เงิน-ดำ','วูฟเกรย์-ดำ','เทา-ครีม-ดำ'],
  'คาวาเลียร์ คิง ชาลส์ สแปเนียล':['ดำ-แทน','ดำ-ขาว','Blenheim','รูบี้'],
  'คานารี ด็อก':['น้ำตาล','น้ำตาลแกมเหลือง','ทอง','ส้ม','เงิน','ลายเสือ'],
  'คอเคเซียน เชพเพิร์ด':['Agouti & White','ดำ','ดำ-เทา','ครีม','น้ำตาลแกมเหลือง','เทา','Grizzle','แดง','สนิม','เซเบิล','ขาว'],
  'เคอร์รี บลู เทอร์เรีย':['น้ำเงินเทา'],
  'เครนเทอร์เรีย':['ดำ','ครีม','เทา','แดง','เงิน','เหลืองอ่อน','ลายเสือ','เทาลายเสือ','แดงลายเสือ','ครีมลายเสือ','ดำลายเสือ'],
  'เคน คอร์โซ่':['ดำ','เทา','แดง','น้ำตาลแกมเหลือง','เทาลายเสือ','ดำลายเสือ','น้ำตาลแก่ลายเสือ'],
  'โคเรียนชินโด':['เหลือง','ขาว','ดำ','เทา','ลายเสือ','ดำ-แทน'],
  'โคตอน เด ทิวเลียร์':['ขาว'],
  'เจแปนนิส สปิตซ์':[ 'ขาว' ],
  'เจแปนนิส ชิน':[ 'ขาว-ดำ','ขาว-แดง'],
  'เจแปนนิส สแปเนียล':[ 'ขาว-ดำ','ขาว-ดำเงา','เหลืองมะนาว-ขาว','แดง-ขาว','น้ำตาลเข้ม-ขาว'],
  'แจ็ครัสเซลเทอเรีย':[ 'ขาว' , 'ขาว-ดำ', 'ขาว-แทน','ขาว-แดง'],
  'ชเนาเซอร์ สแตนดาร์ด':['ดำ','ดำ-เงิน','ดำ-เทา'],
  'ชเนาเซอร์ มินิเจอร์':['ดำ','ดำ-เทา'],
  'ไชนีสเครสเต็ด':['ไม่ระบุ'],
  'เชา เชา':['ดำ','เทา','แดง','ครีม','ชินนาม่อน/กวาง'],
  'เชดแลนด์ ชีพดอก':['น้ำตาล','Tri colour (ดำ-ขาว-น้ำตาล)','ครีม','น้ำเงินครามลายหินอ่อน'],
  'เซาท์ แอฟริกัน มาสทิฟฟ์ (บัวโบว์)':['น้ำตาลเหลือง','น้ำตาล','ครีม','น้ำตาลแดง'],
  'ชิสุ':['ดำ','ดำ-ขาว','น้ำเงิน','น้ำเงิน-ขาว','ลายเสือ','ลายเสือ-ขาว','ทอง','ทอง-ขาว','น้ำตาล(Liver)','น้ำตาล(Liver)-ขาว','แดง','แดง-ขาว','เงิน','เงิน-ขาว'],
  'ชิวาวา':['ดำ','ดำ-แทน','น้ำเงิน-แทน','ช็อคโกแลต','ช็อคโกแลต-แทน','ครีม','น้ำตาลแกมเหลือง','น้ำตาลแกมเหลือง-ขาว','แดง'],
  'ชาเป่ย':['ดำ','น้ำเงิน','น้ำตาล','ครีม','น้ำตาลแกมเหลือง','แดง','Red Fawn','Red Sable','Fawn Sable','Cream Sable','Apricot Dilute','Blue Dilute','Lilac Dilute','Cream Dilute','Chocolate Dilute','Five Point Red Dilute','Isabella Dilute','Black Sable'],
  'ชิบะ อินุ':['แดง','ดำ','งา','ครีม/ขาว'],
  'ซาลูกิ':['ช็อคโกแลต','ครีม','น้ำตาลแกมเหลือง','ทอง','แดง','เงิน','ขาว','ดำ','ดำ-เงิน','ดำ-แทน','ดำ-แทน-ขาว','ช็อคโกแลต-แทน'],
  'ซามอยด์':['น้ำตาล(บิสกิต)','ครีม','ขาว','ขาว-น้ำตาล (บิสกิต)'],
  'ซาร์ลูสวูล์ฟด็อก':['ขาว','แดง','วูฟเกรย์','agouti'],
  'เชคโกสโลวัคเกี้ยน วูล์ฟด็อก':['เงิน-เทา','เหลือง-เทา'],
  'เซนต์เบอร์นาร์ด':['ลายเสือ-ขาว','น้ำตาล-ขาว','สีน้ำตาลแดง-ขาว','ส้ม-ขาว','แดง-ขาว','สนิม-ขาว'],
  'ไซบีเรียน ฮัสกี้':[ 'อะกัวติ-ขาว', 'ดำ' , 'ดำ-ขาว' , 'น้ำตาล-ขาว' ,'เทา-ขาว' , 'แดง-ขาว', 'ขาว' , 'ซาเบิล-ขาว'],
  'ดัลเมเชียน':['ดำ-ขาว','น้ำตาล-ขาว'],
  'ดัชชุน สแตนดาร์ด': [ 'ดำ-ครีม' , 'ดำ-แทน', 'น้ำเงิน-แทน' , 'ช็อคโกแลต-แทน', 'ครีม' , 'แดง', 'เหลืองอ่อน','Wild Boar','น้ำเงิน-ครีม','น้ำตาลแกมเหลือง-แทน','น้ำตาลแกมเหลือง-ครีม','ช็อคโกแลต-ครีม'],
  'ดัชชุน มินิเจอร์': [ 'ดำ-ครีม' , 'ดำ-แทน', 'น้ำเงิน-แทน' , 'ช็อคโกแลต-แทน', 'ครีม' , 'แดง', 'เหลืองอ่อน','Wild Boar','น้ำเงิน-ครีม','น้ำตาลแกมเหลือง-แทน','น้ำตาลแกมเหลือง-ครีม','ช็อคโกแลต-ครีม'],
  'ด็อจ เด บอร์โดซ์':['น้ำตาลแกมเหลือง','สีน้ำตาลแดง','แดง','อิซาเบลลีน'],
  'โดโกอาร์เจนติโน': ['ขาว'],
  'โดเบอร์แมน':['ดำ-สนิม','แดง-สนิม','น้ำเงิน-สนิม','น้ำตาลอ่อน-สนิม','ครีม/ขาว'],
  'ทิเบตัน สแปเนียล':[ 'ดำ' , 'ดำ-แทน', 'ครีม' , 'ทอง','แดง','เซเบิล','ขาว','Silver sable'],
  'ทิเบตัน แมสติฟฟ์':[ 'ดำ' , 'ดำ-แทน', 'น้ำตาล' , 'Red Gold','น้ำตาล-แทน','Blue Grey','Red Gold Sable','Blue Grey-Tan'],
  'ไทยบางแก้ว':[ 'ขาว-แดง','ขาว-เทา','ขาว-ดำ','ขาว'],
  'ไทยหลังอาน':[ 'สวาท' , 'แดง',  'ดำ' , 'กลีบบัว'],
  'บ็อกเซอร์':[ 'น้ำตาลแกมเหลือง','ลายเสือ','ขาว'],
  'บูล เทอร์เรีย':['ดำ-แทน','ดำลายเสือ-ขาว','ดำ-แทน-ขาว','ลายเสือ','ลายเสือ-ขาว','แดง','แดงลายเสือ','ขาว','ขาว-ลายเสือ','แดง-ขาว','ดำลายเสือ'],
  'บูล เทอร์เรีย มินิเจอร์':['ดำ-แทน','ดำลายเสือ-ขาว','ดำ-แทน-ขาว','ลายเสือ','ลายเสือ-ขาว','แดง','แดงลายเสือ','ขาว','ขาว-ลายเสือ','แดง-ขาว','ดำลายเสือ'],
  'บรัสเซิลส์ เทอร์เรียร์':['แดง','belge','ดำ-แทน','ดำ'],
  'บีเวอร์เทอร์เรีย':['ดำ-แทน-ขาว','น้ำเงิน-แทน-ขาว'],
  'บีเกิ้ล':['ดำ-แทน','ดำ-แดง-ขาว','ดำ-แทน-น้ำเงิน','ดำ-แทน-ขาว','ดำ-ขาว-แทน','น้ำตาล-ขาว','น้ำตาล-ขาว-แทน','เลม่อน-ขาว','แดง-ขาว','แทน-ขาว','น้ำเงิน-แทน-ขาว'],
  'บิชอง ฟริเซ่':['ขาว','ครีม','เทา','ส้ม'],
  'บาเซนจิ':[ 'ขาว-ดำ' , 'ดำ-แทน-ขาว', 'ลายเสือ-ขาว' , 'แดง-ขาว'],
  'บาสเซ็ต ฮาวด์':['ดำ-ขาว','ดำ-น้ำตาล-ขาว','ดำ-แทน-ขาว','ดำ-ขาว-น้ำตาล','เลม่อน-ขาว','น้ำตาลแดง-ขาว','แดง-ขาว'],
  'บอสตัน เทอร์เรียร์':['ดำ-ขาว','ดำ-ลายเสือ-ขาว','ลายเสือ-ขาว','Seal-white','Seal Brindle-White'],
  'บอร์ ซอย':['ดำ','ดำ-ลายเสือ','ดำ-ครีม','ดำ-แทน','ลายเสือ','ครีม','ทอง','แดง','แดงลายเสือ','เซเบิล','ขาว','Silver Sable','เงินลายเสือ','ทองลายเสือ','Gold Sable','Brindled Sable','Sables Gold','Sabled Red'],
  'บลัดฮาวด์':['ดำ-แทน','น้ำตาล(Liver)-แทน','แดง'],
  'บริตทานี สแปเนียล':['น้ำตาล(Liver)-ขาว','น้ำตาล(Liver)','ส้ม-ขาว','ส้ม'],
  'บูลลี่ ด็อก':['น้ำตาลแกมเหลือง','ริ้ว (Striped)','ลายเสือ','ดำ-ขาว','น้ำเงิน-ขาว','สีเดียว-ขาว','สีผสม-ขาว','ครีม/ขาว','Tricolour'],
  'บูลแมสติฟฟ์':['น้ำตาลแกมเหลือง','น้ำตาลแกมเหลืองลายเสือ','แดง','แดงลายเสือ','Red Fawn','Red Fawn Brindle'],
  'เบลเยี่ยม มาลินอยส์':['น้ำตาลแกมเหลือง','สีน้ำตาลแดง','แดง','ดำ','ลายเสือ','ครีม','น้ำเงิน','แดงแซมดำ (Red Sable)','น้ำตาลแกมเหลืองแซมดำ (Fawn Sable)'],
  'เบอร์นีส เมาน์เทนด็อก':[ 'ดำ-ขาว-สนิม'],
  'ปอมเมอเรเนียน':['ขาว','ครีม','บีเวอร์','ดำ','น้ำตาล','ลาเวนเดอร์','ส้ม','แดง','เซเบิล','วูลฟ์ เซเบิล','น้ำเงิน'],
  'ปาปิยอง':['ขาว-ดำ','ขาว-เลม่อน','ขาว-แดง','ขาว-เซเบิล','ขาว-ดำ-แทน'],
  'ปั๊ก':[ 'น้ำตาลแกมเหลือง','ดำ'],
  'ปักกิ่ง':['ครีม(บิสกิต)','ดำ','ดำ-แทน','น้ำตาลแกมเหลือง','เทา','แดง','Red Sable','ขาว','Fawn Sable','Gray Sable'],
  'ปูลิ':['ดำ','เงิน','ขาว'],
  'เปอร์โร เดอร์ ปรีซ่า คานาริโอ':['น้ำตาล','น้ำตาลแกมเหลือง','ทอง','ส้ม','เงิน','ลายเสือ'],
  'พ็อมโบรค เวล์ช คอร์กี้':['ดำ-แทน','น้ำตาลแกมเหลือง','แดง','เซเบิล'],
  'พุดเดิ้ล สแตนดาร์ด':['น้ำตาลอ่อน','ดำ','น้ำเงิน','น้ำตาลเข็ม','ครีม/ขาว','เทา','แดง','เงิน','เบจซิลเวอร์','ขาว'],
  'พุดเดิ้ล มินิเจอร์':['น้ำตาลอ่อน','ดำ','น้ำเงิน','น้ำตาลเข็ม','ครีม/ขาว','เทา','แดง','เงิน','เบจซิลเวอร์','ขาว'],
  'พุดเดิ้ล ทอย':['น้ำตาลอ่อน','ดำ','น้ำเงิน','Cafe Au Lait','น้ำตาลเข็ม','ครีม/ขาว','เทา','แดง','เงิน','เบจซิลเวอร์','ขาว'],
  'พุดเดิ้ลถ้วยน้ำชา':['น้ำตาลอ่อน','ดำ','น้ำเงิน','น้ำตาลเข็ม','ครีม/ขาว','เทา','แดง','เงิน','เบจซิลเวอร์','ขาว'],
  'ฟิล่า บราซิเลียโร':['ลายเสือ','น้ำตาลแกมเหลือง','ดำ'],
  'พิทบูลเทอร์เรีย': ['ดำ','แดง','น้ำเงิน','แทน','น้ำตาลแกมเหลือง','ดำลายเสือ','แดงลายเสือ','น้ำเงินลายเสือ','Blue Fawn ลายเสือ','น้ำตาลแกมเหลืองลายเสือ','Tricolour','ขาว','น้ำตาล (liver)','น้ำตาล-แทน','น้ำเงิน-ขาว','ดำ-ขาว','Merle','ลายจุด'],
  'เฟรนช์ มาสทิฟ':['เทาอมทอง','แดง','ฟอว์น','น้ำตาลแดง'],
  'เฟรนช์ บูลด็อก':['ครีม','ขาว','น้ำเงิน','เมิร์ล','ดำ','ฟอว์น','ไลเลค','น้ำเงินครามลายหินอ่อน','ลายเสือ','น้ำเงิน-แทน','น้ำเงิน-ขาว','ดำ-แทน','ดำ-ขาว','น้ำตาล-ดำ'],
  'มิเนเจอร์ ฟิชเชอร์':['ดำ-สนิม','ดำ-แทน','ช็อคโกแลต-แทน','แดง','Stag Red','ช็อคโกแลต-สนิม'],
  'มอลทีส':['ขาว'],
  'มาสทิฟฟ์':['Apricot','Brindle','Fawn'],
  'เยอรมันเชพเพิร์ด':[ 'ดำ-แดง','ดำ-แทน','เทา','แทน','น้ำเงิน','ดำ','ขาว','ดำ-ครีมบริเวณเท้า'],
  'เยอรมันสปิตซ์ (วูฟสปิตซ์)':['เทา'],
  'เยอรมันสปิตซ์ (ไจแอนท์สปิตซ์)':['ขาว','ดำ','น้ำตาล'],
  'เยอรมันสปิตซ์ (มีเดียมสปิตซ์)':['ขาว','ดำ','น้ำตาล','ส้ม','เทา','อื่นๆ'],
  'เยอรมันสปิตซ์ (มิเนียเจอร์สปิตซ์)':['ขาว','ดำ','น้ำตาล','ส้ม','เทา','อื่นๆ'],
  'เยอรมันพิชเชอร์':['ดำ','น้ำตาล','อิซาเบลลีน','แดง'],
  'ยอร์คเชีย เทอเรีย':['ดำ-แทน','ดำ-ทอง','น้ำเงิน-แทน','น้ำเงิน-ทอง'],
  'เยอรมันพอยน์เตอร์ขนสั้น':['ดำ','ดำ-ขาว','น้ำตาล(Liver)','น้ำตาล(Liver)-ขาว','Liver Roan','ดำ'],
  'ร็อตไวเลอร์':[ 'ดำ-สนิม' , 'ดำ-แทน','ดำ-น้ำตาลแดง'],
  'ลาบราดอร์ รีทรีฟเวอร์':['ดำ','ช็อคโกแลต','เหลือ'],
  'ลาซา แอปโช':['ดำ','ดำ-แทน','น้ำเงิน','ครีม','ทอง','เทา','Grizzle','Liver','แดง','Red Gold','เงิน','ขาว'],
  'วิปเพ็ท':['ดำ','Blue Fawn','น้ำเงิน','ครีม','น้ำตาลแกมเหลือง','น้ำตาลแกมเหลืองลายเสือ','แดง','แดงลายเสือ','ขาว','ขาว-ดำ','ขาว-น้ำตาลแกมเหลือง','ขาว-แดง','ขาว-น้ำเงิน','ขาว-น้ำเงินลายเสือ','ขาว-ฺBlue Fawn','ขาว-แดงลายเสือ','ขาว-น้ำตาลแกมเหลืองลายเสือ'],
  'เวลช์ เทอร์เรีย':['ดำ-แทน','เทา-แทน'],
  'เวสตี้ เทอร์เรียร์':['ขาว'],
  'สก็อตติช เทอร์เรีย':['ดำ','ลายเสือ','แดงลายเสือ','เหลืองอ่อน (Wheaten)','ดำลายเสือ','เงินลายเสือ'],
  'สแตฟเฟอร์ดไชร์ บูล เทอร์เรียร์':[ 'ดำ' , 'ดำ-ขาว', 'น้ำเงิน' , 'น้ำเงิน-ขาว', 'ลายเสือ','ลายเสือ-ขาว','น้ำตาลแกมเหลือง','น้ำตาลแกมเหลือง-ขาว','แดง','แดง-ขาว','ขาว'],
  'อเมริกัน บูลด็อก': ['น้ำตาลแกมเหลือง','ลายเสือ','ดำ-ขาว','น้ำเงิน-ขาว','สีเดียว-ขาว','สีผสม-ขาว','ครีม/ขาว','Tricolour'],
  'อเมริกัน พิทบูลเทอร์เรีย': ['ดำ','แดง','น้ำเงิน','แทน','น้ำตาลแกมเหลือง','ดำลายเสือ','แดงลายเสือ','น้ำเงินลายเสือ','Blue Fawn ลายเสือ','น้ำตาลแกมเหลืองลายเสือ','Tricolour','ขาว','น้ำตาล (liver)','น้ำตาล-แทน','น้ำเงิน-ขาว','ดำ-ขาว','Merle','ลายจุด'],
  'อเมริกัน ค็อกเกอร์ สแปเนียล':[ 'ดำ' , 'ดำ-แทน', 'ดำ-ขาว' , 'ดำ-ขาว-แทน','น้ำตาล','น้ำตาล-ขาว','น้ำตาล-ขาว-แทน','น้ำตาลอมเหลือง','แดง','แดง-ขาว','เงิน','น้ำตาล-แทน','น้ำตาลอมเหลือง-ขาว'],
  'อเมริกัน อาคิตะ': ['ดำ','ขาว','น้ำตาลลายเสือ','Fawn','แดง','น้ำตาลปนดำ','แดงปนดำ','Fawn ปนดำ','สีเงินปนดำ'],
  'อาคิตะ อินุ':['แดง', 'ลายเสือ', 'งา','ครีม/ขาว'],
  'อลายกัน มาลามิวท์':['Agouti-ขาว','ดำ-ขาว','น้ำเงิน-ขาว','เทา-ขาว','แดง-ขาว','เซเบิล-ขาว','seal-ขาว','เงิน-ขาว','ขาว'],
  'อิตาเลียน เกรฮาวด์':[ 'เซเบิล' , 'ซีล (seal)', 'ดำ' , 'น้ำเงิน', 'น้ำตาลแกมเหลือง' , 'แดง', 'ครีม/ขาว'],
  'อิงลิช บูลด็อก':['น้ำตาลแกมเหลือง','น้ำตาลแกมเหลือง-ลายเสือ','น้ำตาลแกมเหลือง-ขาว','แดง','แดง-ขาว','แดงลายเสือ','แดงลายเสือ-ขาว','ขาว','Fallow'],
  'อัฟกัน ฮาวนด์':['ดำ','ดำ-เงิน', 'ดำ-แทน','น้ำเงิน','ครีม','แดง','เงิน','ขาว','น้ำเงิน-ครีม'],
  'อิงลิช ค็อกเกอร์ สแปเนียล':['ดำ','ดำ-แทน','ดำ-ขาว','ดำ-ขาว-แทน','น้ำตาล','น้ำตาล-ขาว','น้ำตาล-ขาว-แทน','สีน้ำตาลอมเหลือง','แดง','แดง-ขาว','เงิน','น้ำตาล-แทน','สีน้ำตาลอมเหลือง-ขาว','Brown Roan-Tan'],
  'อิงลิช ทอย สแปเนียล':['Blenheim', 'สีดำ-น้ำตาลแทน', 'สามสี', 'Ruby'],
  'อียิปต์ ฟาโรห์ ฮาวด์':['ชิวนัส(Chestnut)','แดง','แทน'],
  'โอลอิงลิช ชีพด็อก':[ 'ดำ','น้ำเงิน','น้ำเงินลายหินอ่อน','เทา'],
  'ไอริช เซตเทอร์':['มะฮอกกานี','แดง','ชิวนัส(Chestnut)'],
  'ไอริช เทอร์เรีย':['แดง','Red Wheaten','เหลืองอ่อน(Wheaten)'],
};

List<String> banOnPlaneTransport = ['ปักกิ่ง','ชาเป่ย','บอสตัน เทอร์เรียร์','บ็อกเซอร์','บรัสเซิลส์ เทอร์เรียร์','เจแปนนิส สแปเนียล','ปั๊ก','ด็อจ เด บอร์โดซ์','เชา เชา','เซาท์ แอฟริกัน มาสทิฟฟ์ (บัวโบว์)','มาสทิฟฟ์','ทิเบตัน สแปเนียล','บูลลี่ ด็อก','เฟรนช์ บูลด็อก','อิงลิช บูลด็อก','อเมริกัน บูลด็อก','อเมริกัน พิทบูลเทอร์เรีย','พิทบูลเทอร์เรีย','สแตฟเฟอร์ดไชร์ บูล เทอร์เรียร์','อิงลิช ทอย สแปเนียล','ลาซา แอปโช','เบอร์มีส','หิมาลายัน','เปอร์เซีย','เอ็กโซติก ช็อตแฮร์'];

List<String> catColours = ['ขาว','ดำ','น้ำเงิน','น้ำตาล','แดง','ครีม','ช็อคโกแลต','ม่วงอ่อน(Lilac)','น้ำตาลเหลือง(Cinnamon)','น้ำตาลแกมเหลือง(Fawn)','เซเบิล','ไม่มีขน'];

List<String> dummy = [];

var catBreedMapping = {
  'โกนจา': catColours,
  'ขาวมณี': catColours,
  'คาราคัล': catColours,
  'คอร์นิชเรกซ์': catColours,
  'คูริเลียน บ็อบเทล': catColours,
  'คัลเลอร์พอยต์ขนสั้น': catColours,
  'คินคาโล': catColours,
  'โคราช': catColours,
  'แคลิฟอร์เนียสแปงเกิลด์': catColours,
  'ชอซี': catColours,
  'ชินชิลล่า': catColours,
  'ชาร์ตรู': catColours,
  'ซาวันนา':catColours,
  'แซมเศวต':catColours,
  'ไซบีเรียนฟอเรสต์': catColours,
  'ไซปรัส': catColours,
  'เซเรนเจตี': catColours,
  'เซลเกิร์กเรกซ์': catColours,
  'โซโกเก': catColours,
  'โซมาลี': catColours,
  'ซิมริก': catColours,
  'เดวอนเรกซ์': catColours,
  'ดอนสกอย': catColours,
  'ดราก้อนหลี่': catColours,
  'เตอร์กิชแวน': catColours,
  'ทิฟฟานี': catColours,
  'ท็องกินิส': catColours,
  'นอร์วีเจียนฟอเรสต์': catColours,
  'เนบีลัง': catColours,
  'นโปเลียน': catColours,
  'บริติช ช็อตแฮร์': catColours,
  'บริติชขนยาว': catColours,
  'บอมเบย์': catColours,
  'เบอร์มิลลา': catColours,
  'เบงกอล': catColours,
  'บาหลี': catColours,
  'เบอร์แมน': catColours,
  'เบอร์มีส': catColours,
  'แบมบิโน่': catColours,
  'เปอร์เซีย':catColours,
  'พิกซีบ็อบ': catColours,
  'เพเทอร์บัลด์': catColours,
  'ฟอร์เด็ก(Foldex)' : catColours,
  'ทอยเกอร์':catColours,
  'เทอร์คิชแองโกรา':catColours,
  'ม็อกกี้': catColours,
  'เมนคูน': catColours,
  'แมงซ์': catColours,
  'แม่โขงหางสั้น': catColours,
  'ยอร์กช็อกโกแลต': catColours,
  'ยูโรเปียนขนสั้น': catColours,
  'ยูเครน Levkoy': catColours,
  'เยอรมันเรกซ์': catColours,
  'จาวานีส': catColours,
  'แร็กดอลล์': catColours,
  'รัสเซียนบลู': catColours,
  'ริงเทล': catColours,
  'รากามัฟฟิน': catColours,
  'ไลคอย': catColours,
  'ลาเปิร์ม': catColours,
  'วิเชียรมาศ': catColours,
  'ศุภลักษณ์': catColours,
  'สฟริงซ์': catColours,
  'สก็อตติช โฟล์ด': catColours,
  'สยาม': catColours,
  'สิงหปุระ': catColours,
  'สโนว์ชู': catColours,
  'หางกุด ญี่ปุ่น': catColours,
  'หางกุด อเมริกัน': catColours,
  'หิมาลายัน': catColours,
  'อารเบียน มูว์': catColours,
  'อเมริกัน ช็อตแฮร์':catColours,
  'อเมริกันไวร์แฮร์':catColours,
  'อะบิสซิเนียน': catColours,
  'อียิปเทียนมัว': catColours,
  'อีเจียน': catColours,
  'อ็อกซิแคต': catColours,
  'ออสเตรเลียนมิสต์': catColours,
  'เอเชียน': catColours,
  'อเมริกัน เคิร์ล': catColours,
  'โอเรียนทัล ช็อตแฮร์': catColours,
  'โอเรียนทัลขนยาว': catColours,
  'โอโจสแอซูเลส': catColours,
  'เอ็กโซติก ช็อตแฮร์': catColours,
  'ฮาวานาบราวน์': catColours,
  'ไฮแลนเดอร์': catColours,
};

DateTime now = DateTime.now();
DateFormat formatter = DateFormat('yyyy');
String yearString = formatter.format(now);

int currentYear = int.parse(yearString);

const List<String> typeList = ['สุนัข','แมว'];
const List<String> titleList = ['นาย','นาง','นางสาว'];
const List<String> categoryList = ['Dog Food','Cat Food'];
const List<String> dogBrandList = ['Acana','ALPO','ANF','Buzz Dog','Bok Dok','Canegan','Earthborn','Happy Dog','Hills','Jerhigh','LuvCare','MAXIMA','Orijen','Pedigree','Pinnacle','ProPlan','Prowild','Royal Canin','Smart Heart','Taste of the wild','ไม่มีแบรน'];
const List<String> catBrandList = ['Canegan','Earthborn','Hills','Kaniva','Me-O','MAXIMA','Monchou','NEEZ+', 'Orijen','Pedigree','Petheria','ProPlan','Purina','Royal Canin','Sheba','Smart Heart','Taste of the wild','Whiskas','ไม่มีแบรน'];
const List<String> TargetAgeList = ['เด็ก','ผู้ใหญ่','แก่','ไม่ระบุ'];
const List<String> sizeList = ['ขนาดเล็ก','ขนาดกลาง','ขนาดใหญ่','ไม่ระบุ'];
const List<String> userGendersList = ['ชาย','หญิง'];
const List<String> gendersList = ['ตัวผู้','ตัวเมีย'];
const List<String> pedigreeList = ['Yes','No'];
const List<String> dietList = ['ไม่ระบุ','Dairy Free','Gluten Free','Grain Free','Natural','No GMO','No Preservatives','No Wheat','Vegan','None'];
const List<String> healthConsiderList = ['ไม่ระบุ','Fussy Appetite','Hypoallergenic','Sensitive Digestion','Weaning','Weight Control','None'];
const List<String> medFunctionList = ['ไม่ระบุ','Dental Care','Digestive Remedies','Eye Care','Hair & Skin Care','Hairball Remedies','Hip & Joint Care','Immune Boosters','Urinary Care'];
const List<String> foodFormList = ['ไม่ระบุ','อาหารแห้ง','อาหารแช่แข็ง','อาหารเปียก'];
const List<String> weightList = ['ไม่ระบุ','10 กรัม','20 กรัม','30 กรัม','50 กรัม','100 กรัม','150 กรัม','200 กรัม','250 กรัม','300 กรัม','500 กรัม','750 กรัม','1 กิโลกรัม','1.5 กิโลกรัม','2 กิโลกรัม','3 กิโลกรัม','5 กิโลกรัม','5.9 กิโลกรัม','11 กิโลกรัม','11.5 กิโลกรัม','12 กิโลกรัม'];
const List<String> volList = ['ไม่ระบุ','10 มิลลิลิตร','20 มิลลิลิตร','30 มิลลิลิตร','40 มิลลิลิตร','50 มิลลิลิตร','100 มิลลิลิตร','150 มิลลิลิตร','200 มิลลิลิตร','250 มิลลิลิตร','300 มิลลิลิตร','400 มิลลิลิตร','500 มิลลิลิตร','750 มิลลิลิตร','1 ลิตร'];
const List<String> catPatternList = ['สีเดียวทั่วทั้งตัว(Solid colour)','สีขาวพื้นบนตัวมีแถบสีอื่น(Bi-Colour)','ลายแมว(Tabby)','สีผสม 2 สีบนตัว(Tortoiseshell)','สีผสม 3 สีบนตัว(Calico)','สีเข้มบริเวณใบหน้า เท้า และหาง(Colour Point)'];
const List<String> bankList = ['กรุงเทพ','กสิกรไทย','กรุงไทย','ทหารไทยธนชาต จำกัด (มหาชน)','ไทยพาณิชย์','ซิตี้แบงค์','สแตนดาร์ดชาร์เตอร์ด (ไทย)','ซีไอเอ็มบี','อาร์ เอช บี จำกัด','ยูโอบี','กรุงศรีอยุธยา','ออมสิน','อาคารสงเคราะห์','เพื่อการเกษตรและสหกรณ์','ทิสโก้','เกียรตินาคิน','เกียรตินาคิน','ไอซีบีซี (ไทย)','แลนด์แอนด์เฮ้าส์'];
const List<String> cardTypeList = ['visa','MasterCard','JCB'];
const List<String> monthList = ['ม.ค.','ก.พ.','มี.ค.','เม.ย','พ.ค.','มิ.ย','ก.ค.','ส.ค.','ก.ย.','ต.ค.','พ.ย.','ธ.ค.'];
const List<String> pedTypeList = ['COMPLETE CERTIFIED','INCOMPLETE CERTIFIED','CERTIFIED EXPORT','UNCERTIFIED'];
const List<String> deleteAccountList = ['แอปเด้งบ่อย','ตัวเลือกน้อยเกินไป','แอปทำให้เครื่องช้า','พนักงานบริการไม่ดี','เหตุผลอื่น'];

var flightList = ['นกแอร์'];
var airportList = [
  'ท่าอากาศยานดอนเมือง',
  'ท่าอากาศยานนานาชาติแม่ฟ้าหลวง เชียงราย',
  'ท่าอากาศยานเชียงใหม่',
  'ท่าอากาศยานพิษณุโลก',
  'ท่าอากาศยานนานาชาติอุบลราชธานี',
  'ท่าอากาศยานนานาชาติอุดรธานี',
  'ท่าอากาศยานสกลนคร',
  'ท่าอากาศยานนานาชาตินครศรีธรรมราช',
  'ท่าอากาศยานหาดใหญ่ ',
  'สนามบินสุราษฎร์ธานี',
  'ท่าอากาศยานเลย',
  'ท่าอากาศยานตรัง',
  'ท่าอากาศยานภูเก็ต',
];


String condition = 'เรียนผู้ใช้บริการแอปพลิเคชั่นมัลติพอว์สทุกท่าน การเข้าใช้งานแอปพลิเคชั่นรวมไปถึงการใช้บริการต่าง ๆ บนแอปพลิเคชั่นนี้ ถือว่าท่านได้ตกลงที่จะปฎิบัติตามและยอมรับทุกข้อกำหนดและเงื่อนไขของทางมัลติพอว์สทุกประการ'
    '\n\nข้อที่ 1 คำนิยาม'
    '\n(1) "แอปพลิเคชั่น" หมายความว่า แอปพลิเคชั่นที่มีชื่อว่า มัลติพอว์ส หรือ MultiPaws มีวัตถุประสงค์เพื่อเป็นสื่อกลางในการหาคู่ผสมพันธุ์ให้สัตว์เลี้ยง, ให้เช่าพื้นที่สำหรับซื้อขายสัตว์เลี้ยง และจัดจำหน่ายอาหารและอุปกรณ์สำหรับสัตว์เลี้ยงที่เกี่ยวข้อง'
    '\n(2) "ผู้ใช้งาน" หมายถึง ผู้เยี่ยมชม ผู้ใช้งาน ไม่ว่าจะเป็นสมาชิกหรือไม่ก็ตามที่เข้าถึงแอปพลิเคชั่นโดยกระทำผ่านอุปกรณ์ใด ๆ ก็ตาม'
    '\n(3) "ข้อมูลส่วนตัว" หมายถึงข้อมูลใด ๆ หรือบุคคลที่สามารถนำมาระบุตัวตนนั้น ๆ ทั้งทางตรงและทางอ้อม'
    '\n(4) "เนื้อหา" หมายถึง บทความ ข้อความ ความคิดเห็น เครื่องหมาย สัญลักษณ์ คำสั่ง ชุดคำสั่ง และสื่อดิจิตอลต่าง ๆ ที่ปรากฎบนแอปพลิเคชั่น'
    '\n(5) "เจ้าของแอปพลิเคชั่น" หมายถึง บริษัท มัลติพอว์ส จำกัด ทะเบียนนิติบุคคลเลขที่ 0125565008009'
    ''
    '\n\nข้อ 2 ข้อห้ามในการใช้งาน'
    '\n(1) ห้ามโพสต์ภาพหรือข้อความที่เป็นการละเมิดลิขสิทธิ์ของผู้อื่นรวมถึงแต่ไม่จำกัดเฉพาะลิขสิทธิ์ เครื่องหมายการค้า'
    '\n(2) ห้ามโพสรูปภาพหรือข้อความที่เป็นการละเมิดผู้อื่นลงบนแอปพลิเคชั่น'
    '\n(3) ห้ามโพสรูปภาพหรือข้อความที่เป็นการส่งเสริมความรุนแรง หรือข้อมูลอันเป็นเท็จอันเข้าข่ายหลอกลวงเพื่อให้ผู้อื่นเข้าใจผิดอันจะก่อให้เกิดความเสียหายต่อผู้อื่นหรือไม่ก็ตาม'
    '\n(4) ห้ามโพสข้อความหรือรูปภาพที่ไม่เกี่ยวข้องกับแอปพลิเคชั่น'
    '\n(5) ห้ามโพสรูปภาพ ข้อความ ทำการซื้อขาย หรือกระทำการใดก็ตามที่เกี่ยวข้องกับสัตว์ที่อยู่ในบัญชีคุ้มครองทุกชนิด'
    '\n(6) ห้ามกระทำการใด ๆ ที่ใช้ประโยชน์จากแอปพลิเคชั่นในการทำผิดกฎหมาย'
    '\n(7) ห้ามกระทำการใด ๆ ที่เป็นการเก็บข้อมูล เปิดเผยข้อมูล หรือนำข้อมูลจากทางแอปพลิเคชั่นไปใช้โดยไม่ได้รับอนุญาต'
    '\n(8) ห้ามกระทำการใด ๆ ที่เป็นการรบกวนระบบเครือข่ายของแอปพลิเคชั่นนี้'
    '\n(9) ห้ามกระทำการใด ๆ ที่ขัดต่อกฎหมาย ศีลธรรมอันดีงาม และจารีตประเพณีของสังคม'
    ''
    '\n\nข้อ 3 บัญชีผู้ใช้งาน'
    '\n(1) มัลติพอว์สมีสิทธิแต่เพียงผู้เดียวในการอนุมัติบัญชีใช้งาน'
    '\n(2) มัลติพอว์สจะจัดเก็บรหัสผ่านและข้อมูลส่วนตัวของผู้ใช้งานให้ดีที่สุด'
    '\n(3) หากมีการใช้งานบัญชีโดยบุคคลอื่่น เจ้าของบัญชียยอมรับว่าบุคคลนั้นเป็นผู้แทนของตนและมีผลผูกพันเสมือนตนเป็นผู้กระทำเอง'
    ''
    '\n\nข้อ 4 การเก็บและการใช้ข้อมูลของผู้ใช้งาน'
    '\n(1) ผู้ใช้งานอนุญาตให้แอปพลิเคชั่นสามารถจัดเก็บและนำข้อมูลของผู้ใช้งานไปใช้วิเคราะห์เพื่อพัฒนาผลิตภัณฑ์ให้ดียิ่งขึ้น'
    '\n(2) ผู้ใช้งานมีสิทธิในการแก้ไข ปฎิเสธ หรือเพิกถอนการยินยอมในการเก็บข้อมูลโดยต้องไม่ขัดต่อนโยบายของแอปพลิเคชั่น'
    '\n(3) ผู้ใช้งานยอมรับและอนุญาตให้แอปพลิเคชั่นสามารถเปิดเผยข้อมูลภายใต้นโยบายความเป็นส่วนตัว'
    '\n(4) มัลติพอว์สมีสิทธิในการลบโพส ข้อความ รูปภาพ หรือแม้แต่ระงับการใช้งานบัญชีหากพบว่าขัดต่อเงื่อนไขการใช้งาน โดยการตัดสินใจของมัลติพอว์สถือเป็นที่สิ้นสุด'
    ''
    '\n\nข้อ 5 ข้อผูกพันและความรับผิดชอบของผู้ใช้งาน'
    '\n(1) ผู้ใช้งานได้อ่านและยอมรับเงื่อนไขต่าง ๆ และตกลงที่จะปฎิบัติตามข้อกำหนดในฉบับนี้ทั้งสิ้น'
    '\n(2) ผู้ใช้งานเข้าใจและยอมรับว่าสัญญาฉบับนี้เป็นสัญญาระหว่างมัลติพอว์สกับผู้ใช้งาน และมีผลผูกพันบังคับใช้ได้ตามกฎหมาย'
    '\n(3) ในกรณีผู้ใช้งานถูกใช้สิทธิเรียกร้อง หรือผู้ใช้งานถูกฟ้องร้องดำเนินคดีเกี่ยวกับหรือมีสาเหตุมาจากการใช้งานแอปพลิเคชั่น ผู้ใช้งานจะยุติข้อเรียกร้องดังกล่าวโดยออกค่าใช้จ่ายและรับผิดชอบแต่เพียงผู้เดียว โดยมัลติพอว์สจะไม่มีส่วนเกี่ยวข้องในกระบวนการยุติข้อเรียกร้องดังกล่าว'
    '\n(4) ในกรณีที่การกระทำของผู้ใช้งานก่อให้เกิดความเสียหายต่อมัลติพอว์ส ผู้ใช้งานตกลงจะชดใช้ค่าเสียหายดังกล่าวแก่มัลติพอว์สโดยสิ้นเชิง'
    '\n(5) ในกรณีที่เกิดข้อพิพาทระหว่างผู้ซื้อและผู้ขาย คำตัดสินของมัลติพอว์สถือเป็นที่สิ้นสุด ผู้ซื้อและผู้ขายตกลงที่จะยอมรับและปฎิบัติตาม'
    ''
    '\n\nข้อ 6 ความพร้อมและความเสถียรของแอปพลิเคชั่น'
    '\n ผู้ใช้งานเข้าใจและตกลงว่ามัลติพอว์สไม่มีหน้าที่ชดเชยความเสียหายใด ๆ ที่อาจเกิดขึ้้น โดยมัลติพอว์สอาจระงับการใช้งานแอปพลิเคชั่นชั่วคราวหรือถาวร ในกรณีดังต่อไปนี้'
    '\n(1) การปิดระบบเพื่อพัฒนาหรือแก้ไขข้อผิดพลาดของแอปพลิเคชั่น'
    '\n(2) ความผิดพลาดของชุดคำสั่งอันเนื่องมาจากข้อผิดพลาดของระบบเองหรือจากบุคคลภายนอก'
    '\n(3) เหตุสุดวิสัยรวมถึงแต่ไม่จำกัดเพียงภัยธรรมชาติและคำสั่งของรัฐ'
    ''
    '\n\nข้อ 7 ข้อสงวนสิทธิและข้อจำกัดความรับผิด'
    '\n(1) ผู้ใช้งานยอมรับและเข้าใจดีว่าในส่วนของการหาคู่ให้สัตว์เลี้ยง มัลติพอว์สเป็นเพียงสื่อกลางเท่านั้น หากเกิดปัญหากับสินค้า สินค้าไม่ตรงตามที่ตกลง หรือเกิดข้อพิพาทใดๆ ผู้ใช้งานจะต้องเป็นผู้รับผิดชอบ โดยมัลติพอว์สไม่มีส่วนเกี่ยวข้องใด ๆ ทั้งสิ้น อนึ่ง การชำระค่าบริการ มัลติพอว์สมิได้มีส่วนเกี่ยวข้องใด ๆ ผู้ใช้งานต้องดำเนินการติดต่อหรือฟ้องร้องด้วยตนเอง'
    '\n(2) ผู้ใช้งานยอมรับและเข้าใจดีว่าในส่วนของการซื้อขายสัตว์เลี้ยง มัลติพอว์สเป็นเพียงสื่อกลางในการรับชำระเงินและยอมรับว่าการตัดสินของมัลติพอว์สถือเป็นที่สิ้นสุด โดยผู้ใช้งานจะยอมรับการตัดสินนั้นๆและจะไม่ใช้สิทธิในการฟ้องร้องมัลติพอว์สและผู้ใช้งานอีกฝั่ง'
    '\n(3) ผู้ใช้งานยอมรับและเข้าใจดีว่าผู้ใช้งานจะไม่โพสอะไรใด ๆ ที่เกี่ยวข้องกับสัตว์ป่าคุ้มครองทุกชนิด หากการกระทำดังกล่าวนำไปสู่ความผิด มัลติพอส์วจะไม่รับผิดชอบต่อการกระทำของผู้ใช้งาน โดยผู้ใช้งานยอมรับและยินยอมรับผิดในการกระทำดังกล่าวตามกฎหมายแต่เพียงผู้เดียว'
    '\n(4) มัลติพอส์วไม่รับผิดชอบค่าเสียหายใด ๆ อันเกิดจากข้อผิดพลาดอันเนื่องมาจากระบบ ชุดคำสั่ง ความเสถียร ความปลอดภัย และข้อผิดพลาดของแอปพลิเคชั่น'
    '\n(5) มัลติพอส์วไม่รับผิดชอบค่าเสียหายใด ๆ อันเกิดจากผู้ใช้งานแอปพลิเคชั่น อันรวมถึงแต่ไม่จำกัดเพียงการสูญหายของข้อมูลรวมไปถึงการเสียชื่อเสียงของผู้ใช้งาน'
    '\n(6) มัลติพอส์วไม่รับผิดชอบค่าเสียหายใด ๆ อันเกิดจากการใช้งานแอปพลิเคชั่นของบุคคลภายนอกอันรวมถึงแต่ไม่จำกัดเพียงการโจรกรรมข้อมูลของ Hacker'
    ''
    '\n\nข้อ 8 การแก้ไขเปลี่ยนแปลงหรือเพิ่มเติมเงื่อนไขและข้อตกลงการใช้งาน'
    '\n มัลติพอส์ลขอสงวนสิทธิในการแก้ไขหรือเพิ่มเติมเงื่อนไขใด ๆ ในแอปพลิเคชั่นในช่วงเวลาใด ๆ ก็ตาม โดยมิต้องบอกกล่าว และไม่ได้มีหน้าที่บอกกล่าวต่อบุคคลใด ซึ่งหากผู้ใช้งานยังคงใช้งานแอปพลิเคชั่น ถือว่าผู้ใช้งานยอมรับและรับทราบข้อตกลงรวมถึงส่วนที่เพิ่มเติมหรือแก้ไขนั้น ๆ แล้ว'
    ''
    '\n\nข้อ 9 การโอนสิทธิ'
    '\n ผู้ใช้งานตกลงและยอมรับว่าจะไม่โอนสิทธิหน้าที่และความรับผิดต่อให้กับบุคคลใด'
    ''
    '\n\nข้อ 10 ทรัพย์สินทางปัญญา'
    '\n บรรดาข้อมูลที่ปรากฏบนแอปพลิเคชั่นนี้ ซึ่งรวมถึงแต่ไม่จำกัดเฉพาะรูปภาพ ข้อความ กราฟิกต่าง ๆ การออกแบบหน้าจอของแอปพลิเคชั่น การออกแบบส่วนต่อประสานกับผู้ใช้ ชุดคำสั่ง รวมไปถึงเครื่องหมายการค้า และข้อมูลต่าง ๆ ไม่ว่าจะอยู่ในรูปแบบใด ชุดข้อมูลใด ๆ ที่มีอยู่ในแอปพลิเคชั่นนี้ ถือเป็นสิทธิของบริษัทมัลติพอส์ลแต่เพียงผู้เดียว'
    ''
    '\n\nข้อ 11 การบังคับใช้กฎหมาย '
    '\n ข้อตกลงและเงื่อนไขการการใช้งานเว็บไซต์นี้อยู่ภายใต้บังคับแห่งกฎหมายไทย'
    ''
    '\n\nข้อตกลงและเงื่อนไขอาจมีการแก้ไขเปลี่ยนแปลงในอนาคต และหากผู้ใช้งานได้เข้าใช้งานเว็บไซต์นี้ภายหลังการเปลี่ยนแปลงดังกล่าวแล้ว ย่อมถือว่าผู้ใช้งานตกลงยอมรับข้อตกลงและเงื่อนไขการใช้ทั้งหมดตามที่ได้เปลี่ยนแปลงแล้ว หากท่านไม่เห็นด้วยหรือปฏิเสธความมีผลผูกพันตามข้อตกลงและเงื่อนไขข้างต้น กรุณายุติการใช้งานแอปพลิเคชั่นนี้';



